lkolbly/cmsis-svd/data/Holtek/HT32F65230_40.svd
        <!--IP14-->
        <register>
          <name>IP14</name>
          <displayName>IP14</displayName>
          <description>IP14</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_56</name>
              <description>PRI_56</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_57</name>
              <description>PRI_57</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_58</name>
              <description>PRI_58</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_59</name>
              <description>PRI_59</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP15-->
        <register>
          <name>IP15</name>
          <displayName>IP15</displayName>
          <description>IP15</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_60</name>
              <description>PRI_60</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_61</name>
              <description>PRI_61</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_62</name>
              <description>PRI_62</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_63</name>
              <description>PRI_63</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP16-->
        <register>
          <name>IP16</name>
          <displayName>IP16</displayName>
          <description>IP16</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_64</name>
              <description>PRI_64</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_65</name>
              <description>PRI_65</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_66</name>
              <description>PRI_66</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_67</name>
              <description>PRI_67</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP17-->
        <register>
          <name>IP17</name>
          <displayName>IP17</displayName>
          <description>IP17</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_68</name>
              <description>PRI_68</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CPUID-->
        <register>
          <name>CPUID</name>
          <displayName>CPUID</displayName>
          <description>CPUID</description>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>REVISION</name>
              <description>REVISION</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PARTNO</name>
              <description>PARTNO</description>
              <bitRange>[15:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>VARIANT</name>
              <description>VARIANT</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IMPLEMENTER</name>
              <description>IMPLEMENTER</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ICSR-->
        <register>
          <name>ICSR</name>
          <displayName>ICSR</displayName>
          <description>ICSR</description>
          <addressOffset>0x00000D04</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>VECTACTIVE</name>
              <description>VECTACTIVE</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RETTOBASE</name>
              <description>RETTOBASE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>VECTPENDING</name>
              <description>VECTPENDING</description>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ISRPENDING</name>
              <description>ISRPENDING</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ISRPREEMPT</name>
              <description>ISRPREEMPT</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>PENDSTCLR</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>PENDSTSET</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PENDSVCLR</name>
              <description>PENDSVCLR</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PENDSVSET</name>
              <description>PENDSVSET</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NMIPENDSET</name>
              <description>NMIPENDSET</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
